01  WS-AREA-1 PIC X(100). 01  WS-AREA-2 PIC 9(5) VALUE 0. 01  WS-TEMP PIC 9(5). ... COMPUTE WS-TEMP = FUNCTION NUMVAL(WS-AREA-1(1:5)) MOVE WS-TEMP TO WS-AREA-2.